#include <stdio.h>
#define KEY 1
#define main main_sort
//直接插入排序算法
/*
while循环排序后的顺序是：69 69 12 136 3 55 46 99 88 25
for循环排序后的顺序是：  56 69 12 136 3 55 46 99 88 25
while循环排序后的顺序是：56 69 69 136 3 55 46 99 88 25
while循环排序后的顺序是：56 56 69 136 3 55 46 99 88 25
for循环排序后的顺序是：  12 56 69 136 3 55 46 99 88 25
for循环排序后的顺序是：  12 56 69 136 3 55 46 99 88 25
while循环排序后的顺序是：12 56 69 136 136 55 46 99 88 25
while循环排序后的顺序是：12 56 69 69 136 55 46 99 88 25
while循环排序后的顺序是：12 56 56 69 136 55 46 99 88 25
while循环排序后的顺序是：12 12 56 69 136 55 46 99 88 25
for循环排序后的顺序是：  3 12 56 69 136 55 46 99 88 25
while循环排序后的顺序是：3 12 56 69 136 136 46 99 88 25
while循环排序后的顺序是：3 12 56 69 69 136 46 99 88 25
while循环排序后的顺序是：3 12 56 56 69 136 46 99 88 25
for循环排序后的顺序是：  3 12 55 56 69 136 46 99 88 25
while循环排序后的顺序是：3 12 55 56 69 136 136 99 88 25
while循环排序后的顺序是：3 12 55 56 69 69 136 99 88 25
while循环排序后的顺序是：3 12 55 56 56 69 136 99 88 25
while循环排序后的顺序是：3 12 55 55 56 69 136 99 88 25
for循环排序后的顺序是：  3 12 46 55 56 69 136 99 88 25
while循环排序后的顺序是：3 12 46 55 56 69 136 136 88 25
for循环排序后的顺序是：  3 12 46 55 56 69 99 136 88 25
while循环排序后的顺序是：3 12 46 55 56 69 99 136 136 25
while循环排序后的顺序是：3 12 46 55 56 69 99 99 136 25
for循环排序后的顺序是：  3 12 46 55 56 69 88 99 136 25
while循环排序后的顺序是：3 12 46 55 56 69 88 99 136 136
while循环排序后的顺序是：3 12 46 55 56 69 88 99 99 136
while循环排序后的顺序是：3 12 46 55 56 69 88 88 99 136
while循环排序后的顺序是：3 12 46 55 56 69 69 88 99 136
while循环排序后的顺序是：3 12 46 55 56 56 69 88 99 136
while循环排序后的顺序是：3 12 46 55 55 56 69 88 99 136
while循环排序后的顺序是：3 12 46 46 55 56 69 88 99 136
for循环排序后的顺序是：  3 12 25 46 55 56 69 88 99 136
排序后的顺序是：
3 12 25 46 55 56 69 88 99 136
*/
int insort(int s[], int n) {
	int i,j,m;
	for(i = 2; i<=n; i++) { //数组下标从2开始，s[0]做监视哨
		s[0] = s[i];
		j = i - 1;//确定要比较元素的最右边位
		while(s[0] < s[j]) {
			s[j+1]=s[j];//数据右移
			j--;//移向一个左边未比较的数,一直到j=0的时候停止比较

#if KEY
			/*######################调试代码########################*/
			printf("while循环排序后的顺序是：");
			for(m=1; m<=10; m++)
				printf("%d ",s[m]);
			printf("\n");
			/*######################调试代码########################*/
#endif

		}
		s[j+1]=s[0];//在确定的位置插入s[0]，哨兵值

#if KEY
		/*######################调试代码########################*/
		printf("for循环排序后的顺序是：");
		for(m=1; m<=10; m++)
			printf("%d ",s[m]);    //输出排序后的数组
		printf("\n");
		/*######################调试代码########################*/
#endif

	}
	return 0;
}
/*希尔排序算法*/
int shsort(int s[], int n) {
	int i, j,m, gap;
	gap = n/2; /*gap为确定固定的步长*/
	while(gap >= 1 ) { /*当步长大于1时，循环执行下面的步骤*/
		for(i=gap+1; i<=n; i++) { //数组下标从gap+1开始进行直接插入排序
			s[0]=s[i];//设置监视哨,s[0]就是个哨兵，值会不停的变化的
			j=i-gap;//确定要进行比较的元素的最右边位置
			while((j>0)&&(s[0]<s[j])) { //当监视哨小于比较元素时，执行下面
				s[j+gap]=s[j];
				j=j-gap;//向左移gap个位置

#if KEY
				/*######################调试代码########################*/
				printf("		内层while循环排序后的顺序是：");
				for(m=1; m<=10; m++)
					printf("%d ",s[m]);
				printf("\n");
				/*######################调试代码########################*/
#endif

			}
			s[j+gap] = s[0] ;//在确定位置插入s[i],因为s[0],就是s[i]
#if KEY
			/*######################调试代码########################*/
			printf("for循环排序后的顺序是：");
			for(m=1; m<=10; m++)
				printf("%d ",s[m]);    //输出排序后的数组
			printf("\n");
			/*######################调试代码########################*/
#endif
		}
		gap = gap/2;//步长变成原来的一半
#if KEY
		/*######################调试代码########################*/
		printf("	外层while循环排序后的顺序是：");
		for(m=1; m<=10; m++)
			printf("%d ",s[m]);
		printf("\n");
		/*######################调试代码########################*/
#endif
	}
	return 0;
}

//冒泡排序算法
int pol_sort(int s[], int n) {
	int i, j,temp;
	for(i=1; i<10; i++) { //变量i表示比较的趟数
		for(j=1; j<11-i; j++) {
			if(s[j]>s[j+1]) {
				temp=s[j];//利用中间变量实现两个数的互换
				s[j]=s[j+1];
				s[j+1]=temp;
			}
#if KEY
			/*######################调试代码########################*/
			int m;
			printf("内层for循环排序后的顺序是：");
			for(m=1; m<=10; m++)
				printf("%d ",s[m]);    //输出排序后的数组
			printf("\n");
			/*######################调试代码########################*/
#endif
		}
#if KEY
		/*######################调试代码########################*/
		int m;
		printf("外层for循环排序后的顺序是：");
		for(m=1; m<=10; m++)
			printf("%d ",s[m]);    //输出排序后的数组
		printf("\n");
		/*######################调试代码########################*/
#endif
	}
}
//快速排序算法
int qusort(int s[], int start, int end) {
	int i, j;
	i = start;//每组首个元素下标赋值给i
	j = end;//每组最后一个元素下标给j
	s[0] = s[start]	; //设置基准值
	while(i<j) {
		while(i<j&&s[0]<s[j])
			j--;//位置左移
		if(i<j) {
			s[i]=s[j];
			i++;
		}
#if KEY
		/*######################调试代码########################*/
		int m;
		printf("第一次if循环排序后的顺序是：");
		for(m=1; m<=10; m++)
			printf("%d ",s[m]);    //输出排序后的数组
		printf("\n");
		/*######################调试代码########################*/
#endif
		while(i<j&&s[i]<=s[0])
			i++;
		if(i<j) {
			s[j]=s[i];
			j--;
		}
#if KEY
		/*######################调试代码########################*/

		printf("第二次if循环排序后的顺序是：");
		for(m=1; m<=10; m++)
			printf("%d ",s[m]);    //输出排序后的数组
		printf("\n");
		/*######################调试代码########################*/
#endif
	}
	s[i]=s[0];//将基准值放入指定位置
#if KEY
	/*######################调试代码########################*/
	int m;
	printf("放入基准值后循环排序后的顺序是：");
	for(m=1; m<=10; m++)
		printf("%d ",s[m]);    //输出排序后的数组
	printf("\n");
	/*######################调试代码########################*/
#endif
	if(start<i)
		qusort(s,start,j-1);
	if(i<end)
		qusort(s,j+1,end);
	return 0;
}
//选择排序算法
int select_sort(int s[], int n) {
	int i, j,t;
	for(i=1; i<11; i++) { //从左往右依次找剩下里面最小的数，往前面放
		for(j=i+1; j<=10; j++) {

			if(s[i]>s[j]) {
				t=s[i];
				s[i]=s[j];
				s[j]=t;
#if KEY
				/*######################调试代码########################*/
				int m;
				printf("第一个for循环排序后的顺序是：");
				for(m=1; m<=10; m++)
					printf("%d ",s[m]);    //输出排序后的数组
				printf("\n");
				/*######################调试代码########################*/
#endif
			}

		}
#if KEY
		/*######################调试代码########################*/
		int m;
		printf("第二个for循环排序后的顺序是：");
		for(m=1; m<=10; m++)
			printf("%d ",s[m]);    //输出排序后的数组
		printf("\n");
		/*######################调试代码########################*/
#endif
	}

}
int demo_main() {
	int a[11],i;    //定义数组及变量为基木整甩,11个元素，只赋值了后面10个，第一个没有赋值
	printf("请输入10个数据：\n");
	for (i =1; i<=10; i++)
		scanf("%d",&a[i]);    //接收从键盘输入的10个数据到数组a中
	printf("原始顺序：\n");
	for(i=1; i<11; i++)
		printf("%5d",a[i]);    //将未排序前的顺序输出
	insort(a,10);    //调用自定义函数 insort()
	printf("\n 插入数据排序后顺序：\n");
	for(i=1; i<11; i++)
		printf("%5d",a[i]); //将排序后的数组输出
	printf("\n");
	return 0;
}

int main() {
	int i;
	int s[11] = {10000000,69,56,12,136,3,55,46,99,88,25};  // 3   12   25   46   55   56   69   88   99  136
//	shsort(s,10);//希尔排序算法
//	insort(s,10);//插入排序算法
//	qusort(s,1,10);//快速排序算法
//	pol_sort(s,10);//冒泡排序算法
	select_sort(s,10);//冒泡排序算法
	printf("排序后的顺序是：\n");

	for(i=1; i<=10; i++)
		printf("%d ",s[i]);    /*输出排序后的数组*/
	printf("\n");
	return 0;
}

